20251129T082342--kdoc-491-『マイクロサービスアーキテクチャ』__draft_book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-19T21:49:40Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 491: 『マイクロサービスアーキテクチャ』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 491: 『マイクロサービスアーキテクチャ』</h1>
<div id="outline-container-orgf33a14b" class="outline-2">
<h2 id="orgf33a14b"><a href="#orgf33a14b">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgf33a14b">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<p>
129ページで止まっている。
</p>
</div>
</div>
<div id="outline-container-org217e6b7" class="outline-2">
<h2 id="org217e6b7"><a href="#org217e6b7">概要</a></h2>
<div class="outline-text-2" id="text-org217e6b7">
</div>
</div>
<div id="outline-container-org4ddffac" class="outline-2">
<h2 id="org4ddffac"><a href="#org4ddffac">メモ</a></h2>
<div class="outline-text-2" id="text-org4ddffac">
<ul class="org-ul">
<li>マイクロサービスはサービス指向アーキテクチャ(SOA)の一種である。サービス境界の引き方については意見が分かれるが、独立してデプロイできるのが重要である(p3)</li>
<li>独立デプロイ可能性を実現したい場合、データベースの共有は最悪なことの1つである(p9)</li>
<li>システムのすべての機能をまとめてデプロイしなければならない場合、モノリス、だという(p15)</li>
<li>モジュラモノリス: 各モジュールで独立して作業できるが、デプロイするにはすべてを結合する必要がある。多くの組織で優れた選択肢で、マイクロサービスアーキテクチャの課題を回避しながら高度な並列作業ができる(p17)
<ul class="org-ul">
<li>課題の1つとして、コードレベルで行われるような分解が、データベースにおいては行われない傾向がある(p17)</li>
<li>モジュラごとに分解したデータベースを使うモジュラモノリスもある</li>
</ul></li>
<li>人々はモノリスを避けるべきもの、本質的に問題があるもの、と考えるようになっている。モノリシックアーキテクチャは1つの選択肢であり有効である(p19)</li>
<li>100万行のモノリシックアプリケーションのうち1行を変更したら、その変更をリリースするためにアプリケーション全体をデプロイする必要があるようなデプロイは、影響が大きく危険性の高いものになる可能性がある(p26)</li>
<li>分散システムでは複数プロセスが異なるデータベースで状態を管理する。データ一貫性の観点で課題が発生する可能性がある(p33)</li>
<li>安定したサービス境界を定義することの重要性を考えると、マイクロサービスアーキテクチャは新製品やスタートアップにとって向いてないことが多い。開発するにつれて、作業するドメインが大きく変更されるのが一般的である。ドメインモデルがじゅうぶん安定するまで待ってからサービス境界を定義するほうが適切である(p33)</li>
<li>凝集を説明する簡潔な定義: 一緒に変更され、一緒に存在するコード(p40)</li>
<li>状態が正しく変更されるようにする1つの方法は有限状態機械を作成することだが、複数のマイクロサービスが状態機械を管理する責任を共有していると問題になる。単一のマイクロサービスが状態を管理するとよい(p51)</li>
<li>データベースのCRUD操作の軽量ラッパーのようなマイクロサービスは低凝集、密結合の兆候である。そのサービスにあるべきデータを管理するロジックがシステムの別の場所に分散している(p51)</li>
<li>マイクロサービス境界を探すためのメカニズムはドメイン自体を中心としたものであり、ドメイン駆動設計を利用してドメインモデルを作成する(p55)
<ul class="org-ul">
<li>(感想)ドメイン駆動設計がマイクロサービスのためのものなのを知った</li>
<li>ユビキタス言語: ユーザが使っているのと同じ用語をコード内でも使うように努めるべきであるという考え方。実世界のドメインのモデル化がより簡単になり、コミュニケーションも改善する、という考え方(55)</li>
</ul></li>
<li>アグリゲートの意味がわからない(p62)
<ul class="org-ul">
<li>アグリゲートはより幅広いシステムとの明確に定義されたインターフェースを備えた、凝集ユニットとなる。アグリゲートはシステム内の単一のドメイン概念に焦点を当てた自己完結型の状態機械である</li>
</ul></li>
<li>システムに実装する変更は多くの場合、ビジネス側がシステムの振る舞いに関して行いたい変更に関するものである。顧客に公開している機能を変更する(p65)</li>
<li>ドメインの理解があいまいなままマイクロサービスを作成するのは危険である。最初からマイクロサービスを目指すよりも、マイクロサービスに分解したい既存のコードがあるほうがかんたんである(p78)</li>
<li>多くの企業が、バックエンド機能を分割する利点にだけ目を向け、過度にサイロ化したアーキテクチャ再構築を行っている(p80)</li>
</ul>
</div>
</div>
<div id="outline-container-org414161f" class="outline-2">
<h2 id="org414161f"><a href="#org414161f">関連</a></h2>
<div class="outline-text-2" id="text-org414161f">
<p>
なし。
</p>
</div>
</div>
<div id="outline-container-org52360b9" class="outline-2">
<h2 id="org52360b9"><a href="#org52360b9">Backlinks</a></h2>
<div class="outline-text-2" id="text-org52360b9">
<ul class="org-ul">
<li><a href="./20240704T211631--kdoc-196-気乗りしない仕事に意味を見出す__essay.html">KDOC 196: 気乗りしない仕事に意味を見出す</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
